[options]
splitnets off

[gold]
plugin -i slang
read_verilog ../../../verilog/row_buf.v
chparam -set length 25 row_buf
prep -top row_buf
async2sync

[gate]
plugin -i ghdl
ghdl --std=08 -glength=25 ../../vhdl_row_buf.vhdl -e vhdl_row_buf
rename vhdl_row_buf row_buf
prep -top row_buf
async2sync

[collect row_buf]
join *
# join r

[strategy sby]
use sby
depth 5
engine smtbmc boolector

[strategy sat]
use sat
depth 55

