[options]
splitnets off

[gold]
plugin -i slang
read_verilog ../../../verilog/table_reader.v
prep -top table_reader

[gate]
plugin -i ghdl
ghdl --std=08 ../../vhdl_table_reader.vhdl -e vhdl_table_reader
rename vhdl_table_reader table_reader
prep -top table_reader

[strategy sby]
use sby
depth 2
engine smtbmc boolector

[strategy sat]
use sat
depth 2
